faronov/efr32mg1p-zigbee-sensor/main.c
/**
 * @file main.c
 * @brief Main entry point for Zigbee BME280 Sensor application
 */

#include "sl_component_catalog.h"
#include "sl_system_init.h"
#include "sl_event_handler.h"
#include "sl_sleeptimer.h"
#include "app_sensor.h"
#include <stdio.h>
#include <stdint.h>
#include "app/framework/include/af.h"
#include "hal.h"
#include "micro.h"
#include "cortexm3/diagnostic.h"

#if defined(SL_CATALOG_POWER_MANAGER_PRESENT)
#include "sl_power_manager.h"
#endif

#if defined(SL_CATALOG_KERNEL_PRESENT)
#include "sl_system_kernel.h"
#else
void sl_system_process_action(void);
#endif

void app_debug_sanity(void);
void app_debug_trigger_short_press(void);
void app_debug_trigger_long_press(void);
void app_debug_force_af_init(void);
void app_debug_poll(void);
bool app_debug_button_ready(void);

#ifndef APP_DEBUG_DIAG_ALWAYS
#define APP_DEBUG_DIAG_ALWAYS 0
#endif
#ifndef APP_DEBUG_NO_SLEEP
#define APP_DEBUG_NO_SLEEP 0
#endif
#ifndef APP_DEBUG_MAIN_HEARTBEAT
#define APP_DEBUG_MAIN_HEARTBEAT 0
#endif
#ifndef APP_DEBUG_POLL_BUTTON
#define APP_DEBUG_POLL_BUTTON 0
#endif
#ifndef APP_DEBUG_SLEEP_TRACE
#define APP_DEBUG_SLEEP_TRACE 0
#endif
#ifndef APP_DEBUG_FORCE_AF_INIT
#define APP_DEBUG_FORCE_AF_INIT 0
#endif
#ifndef APP_DEBUG_CRASH_PRINT
#define APP_DEBUG_CRASH_PRINT 0
#endif
#ifndef APP_DEBUG_BOOT_DELAY_MS
#define APP_DEBUG_BOOT_DELAY_MS 0
#endif
#ifndef APP_DEBUG_BOOT_SPAM_MS
#define APP_DEBUG_BOOT_SPAM_MS 0
#endif
#ifndef APP_DEBUG_BOOT_SPAM_PERIOD_MS
#define APP_DEBUG_BOOT_SPAM_PERIOD_MS 1000
#endif
#ifndef APP_DEBUG_LONG_PRESS_MS
#define APP_DEBUG_LONG_PRESS_MS 5000
#endif
#ifndef APP_DEBUG_SHORT_FALLBACK_MS
#define APP_DEBUG_SHORT_FALLBACK_MS 1200
#endif
#ifndef APP_BUILD_TAG
#define APP_BUILD_TAG "unknown"
#endif

#if defined(SL_CATALOG_SIMPLE_BUTTON_PRESENT) && defined(APP_DEBUG_POLL_BUTTON) && (APP_DEBUG_POLL_BUTTON != 0)
#include "sl_simple_button_instances.h"
#endif

static uint8_t app_reset_info = 0;
static bool app_reset_info_valid = false;
static bool app_crash_print_pending = false;
static uint32_t app_boot_tick_start = 0;
static uint32_t app_boot_tick_last = 0;

static void app_debug_record_reset_info(void)
{
  uint8_t reset = halGetResetInfo();
  app_reset_info = reset;
  app_reset_info_valid = true;
  app_crash_print_pending =
    ((RESET_CRASH_REASON_MASK & (1u << reset)) != 0u);
}

static void app_debug_boot_tick(void)
{
#if APP_DEBUG_BOOT_SPAM_MS
  uint32_t now = sl_sleeptimer_get_tick_count();
  if (app_boot_tick_start == 0) {
    app_boot_tick_start = now;
  }
  if (app_crash_print_pending && app_reset_info_valid) {
    printf("Debug: crash reset info=0x%02x (%s)\n",
           app_reset_info,
           halGetResetString());
    halPrintCrashSummary(0);
    halPrintCrashDetails(0);
    app_crash_print_pending = false;
  }
  if (sl_sleeptimer_tick_to_ms(now - app_boot_tick_start) < APP_DEBUG_BOOT_SPAM_MS) {
    if (app_boot_tick_last == 0
        || sl_sleeptimer_tick_to_ms(now - app_boot_tick_last) >= APP_DEBUG_BOOT_SPAM_PERIOD_MS) {
      app_boot_tick_last = now;
      printf("BOOT: tag=%s uptime=%lu ms\n",
             APP_BUILD_TAG,
             (unsigned long)sl_sleeptimer_tick_to_ms(now - app_boot_tick_start));
    }
  }
#endif
}

int main(void)
{
  // Initialize Silicon Labs system
  sl_system_init();

#if APP_DEBUG_CRASH_PRINT || APP_DEBUG_BOOT_SPAM_MS
  app_debug_record_reset_info();
#endif

#if APP_DEBUG_BOOT_DELAY_MS
  // Give time to attach SWO before any logs.
  sl_sleeptimer_delay_millisecond(APP_DEBUG_BOOT_DELAY_MS);
#endif

#if APP_DEBUG_FORCE_AF_INIT
  // Enable AF-init watchdog; fallback callback is handled in app_debug_poll().
  // Avoid direct emberAfInit() call here to keep framework init sequence intact.
  printf("Debug: AF init watchdog enabled\n");
  app_debug_force_af_init();
#endif

  // Early SWO sanity print (debug builds should show this).
#if APP_DEBUG_BOOT_DELAY_MS
  printf("SWO OK: main start (delay=%lu ms, tag=%s)\n",
         (unsigned long)APP_DEBUG_BOOT_DELAY_MS,
         APP_BUILD_TAG);
#else
  printf("SWO OK: main start (tag=%s)\n", APP_BUILD_TAG);
#endif

#if APP_DEBUG_DIAG_ALWAYS
  printf("Debug flags: NO_SLEEP=%d HEARTBEAT=%d POLL_BUTTON=%d\n",
         APP_DEBUG_NO_SLEEP,
         APP_DEBUG_MAIN_HEARTBEAT,
         APP_DEBUG_POLL_BUTTON);
#ifdef EMBER_AF_PLUGIN_OTA_CLIENT_AUTO_START
  printf("Debug: OTA auto-start=%d\n", EMBER_AF_PLUGIN_OTA_CLIENT_AUTO_START);
#endif
#if defined(SL_CATALOG_POWER_MANAGER_PRESENT)
  printf("Power manager: present\n");
#else
  printf("Power manager: absent\n");
#endif

#if APP_DEBUG_DIAG_ALWAYS
  app_debug_sanity();
#endif
#endif

#if defined(SL_CATALOG_POWER_MANAGER_PRESENT) && defined(APP_DEBUG_NO_SLEEP) && (APP_DEBUG_NO_SLEEP != 0)
  // Keep the CPU in EM0 for debug so SWO and logs are reliable.
  sl_power_manager_add_em_requirement(SL_POWER_MANAGER_EM0);
  printf("Debug: sleep disabled (EM0 requirement)\n");
#endif

#if defined(SL_CATALOG_KERNEL_PRESENT)
#if APP_DEBUG_DIAG_ALWAYS
  printf("Kernel present; starting kernel\n");
#endif
  // Start kernel
  sl_system_kernel_start();
#else
#if APP_DEBUG_DIAG_ALWAYS
  printf("Bare metal loop start\n");
#endif
  // Bare metal main loop
  while (1) {
#if APP_DEBUG_CRASH_PRINT || APP_DEBUG_BOOT_SPAM_MS
    app_debug_boot_tick();
#endif
    // Run event handlers
    sl_system_process_action();

#if defined(APP_DEBUG_MAIN_HEARTBEAT) && (APP_DEBUG_MAIN_HEARTBEAT != 0)
    // Throttled main-loop heartbeat for SWO debugging.
    static uint32_t last_heartbeat_tick = 0;
    uint32_t now = sl_sleeptimer_get_tick_count();
    if (last_heartbeat_tick == 0 ||
        sl_sleeptimer_tick_to_ms(now - last_heartbeat_tick) >= 2000) {
      last_heartbeat_tick = now;
      printf("Main loop heartbeat\n");
    }
#endif

    // Process periodic sensor work scheduled by sleeptimer callback.
    app_sensor_process();

#if APP_DEBUG_DIAG_ALWAYS || APP_DEBUG_FORCE_AF_INIT
    // Ensure debug AF init and identity checks run even if AF tick isn't wired.
    app_debug_poll();
#endif

#if defined(SL_CATALOG_POWER_MANAGER_PRESENT)
    // Sleep until next event
#if (APP_DEBUG_SLEEP_TRACE != 0)
    uint32_t sleep_before = sl_sleeptimer_get_tick_count();
#endif
    sl_power_manager_sleep();
#if (APP_DEBUG_SLEEP_TRACE != 0)
    uint32_t sleep_after = sl_sleeptimer_get_tick_count();
    uint32_t slept_ms = sl_sleeptimer_tick_to_ms(sleep_after - sleep_before);
    if (slept_ms >= 20) {
      printf("Sleep trace: woke after %lu ms\n", (unsigned long)slept_ms);
    }
#endif
#endif
  }
#endif

  return 0;
}
